In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('../data_set/2.데이터 클린징/test1.csv')
df

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2
5  a   1   1

In [4]:
df.duplicated() # 자기 자신을 제외한 중복된 데이터들 True로 처리해준다.

0    False
1     True
2    False
3    False
4    False
5     True
dtype: bool

In [5]:
df.duplicated().sum()

2

In [6]:
df.drop_duplicates(inplace=True)
df

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [7]:
df.duplicated().sum()

0

In [9]:
df.reset_index(drop=True) 
# DataFrame의 인덱스를 재설정하는데 사용됩니다. 
# drop=True 옵션을 사용하면 이전에 있던 인덱스는 새로운 열로 추가되지 않고 완전히 삭제됩니다.

  c1  c2  c3
0  a   1   1
1  b   1   2
2  a   2   2
3  b   2   2